---
kind: property
id: P:Autodesk.Revit.DB.DefaultDivideSettings.PathNumber
source: html/b9b98d23-5e6f-ec10-1264-458c3cf43472.htm
---
# Autodesk.Revit.DB.DefaultDivideSettings.PathNumber Property

A default Divided Path number for a fixed number layout.

## Syntax (C#)
```csharp
public int PathNumber { get; set; }
```